<template>
  <pre class="content-text-include">
AMONG EARTH(이하 ‘A402팀’)는 다음과 같은 원칙에 의하여 이용자의 개인정보를 수집, 이용 및 관리하고 있고, 이와 관련하여 정보통신서비스 제공자가 준수하여야 하는 대한민국의 관계법령 및 개인정보보호 규정, 가이드라인을 준수하고 있습니다.

A402팀는 개인정보 처리방침을 통하여, 이용자의 개인정보가 어떠한 용도와 방식으로 이용되고 있으며, 개인정보보호를 위해 A402팀가 어떠한 조치를 취하는지 알려드립니다.
A402팀의 개인정보 처리방침은 다음과 같은 내용을 담고 있습니다.

1. 개인정보의 수집 및 이용 목적
2. 수집하는 개인정보 항목 및 방법
3. 개인정보 보유ㆍ이용기간 및 파기절차 및 방법
4. 개인정보의 제공
5. 개인정보의 처리위탁
6. 이용자 및 법정대리인의 권리와 그 행사방법
7. 개인정보 자동수집 장치의 설치ㆍ운영 및 그 거부에 관한 사항
8. 개인정보의 기술적/관리적 보호대책
9. 개인정보 전담조직 운영
10. 기타 개인정보 처리에 관한 방침


1. 개인정보의 수집 및 이용 목적
A402팀는 다음의 목적을 위하여 개인정보를 수집 및 이용합니다.
가. 회원관리
이용자 식별 및 본인확인, 가입의사 확인, 불량회원 부정이용 방지, 만 14세 미만 아동 개인정보 수집 시 법정 대리인 동의여부 확인, 불만처리 등 민원처리, 공지사항 전달, 회원탈퇴 의사확인, 법정대리인 권리행사 시 본인확인
나. 서비스 이용
콘텐츠 제공
다. 마케팅 및 광고활용
신규 서비스 개발 및 특화, 인구통계학적 특성에 따른 서비스 제공, 접속 빈도파악 또는 회원의 서비스 이용 통계
라. 기타
서비스 유효성 확인, 원활한 양질의 서비스

2. 수집하는 개인정보 항목 및 방법
A402팀는 위 제1항과 같은 ‘개인정보의 수집 및 이용목적’을 위하여 아래와 같은 원칙에 의하여 개인정보를 수집하고 있습니다.
가. 개인정보 수집항목
해당 서비스의 본질적 기능을 수행하기 위한 정보는 필수정보로서 수집하며 이용자가 그 정보를 A402팀에 제공하지 않는 경우 서비스 이용에 제한이 가해질 수 있지만, 선택정보 즉, 보다 특화된 서비스를 제공하기 위해 추가 수집되는 정보의 경우에는 이를 입력하지 않은 경우에도 서비스 이용제한은 없습니다.
서비스 이용에 따라 다음과 같은 정보를 수집합니다.
＜회원가입 시 공통정보＞ 이름, 로그인ID, 비밀번호, 생년월일, 성별, 이메일, 접속로그
＜서비스 이용 시＞ 본인확인 값(CI: 암호화된 개인식별정보, DI: 중복확인정보), 연락처

다만, 이용자의 사상, 신념, 과거의 병력 등 개인의 권리, 이익이나 사생활을 뚜렷하게 침해할 우려가 있는 민감정보는 수집하지 않습니다.
나. 수집 방법
A402팀가 이용자의 개인정보를 수집하는 방법으로는 홈페이지(회원가입, 접속로그) 등을 통해 수집합니다.
다. 이용자의 동의
A402팀는 이용자의 개인정보를 수집할 때, 사전에 해당 사실을 이용자에게 알리고 동의를 구합니다.

<u>3. 개인정보 보유ㆍ이용기간 파기절차 및 방법
가. 개인정보의 보유ㆍ이용 기간 및 파기
이용자의 개인정보에 대하여 개인정보의 수집 및 이용 목적이 달성되었거나, 이용자로부터 동의를 얻은 보유 및 이용 기간이 종료되면 해당 정보를 지체 없이 파기합니다.</u>

정보주체의 권리행사 방법은 아래와 같습니다.
가. 개인정보 열람 및 수정
FEFU → 회원로그인 → 마이고도 → 정보수정
나. 동의철회 및 회원가입 해지
동의철회 및 회원가입 해지의 대상은 A402팀의 서비스를 이용하지 않는 고객만 가능하며, 서비스 이용 고객은 서비스 이용 해지절차를 우선 진행한 후 아래의 절차로 진행합니다.
FEFU → 회원로그인 → 회원탈퇴

7. 개인정보 자동수집 장치의 설치ㆍ운영 및 그 거부에 관한 사항
A402팀는 이용자의 정보를 수시로 저장하고 찾아내어 보다 빠르고 편리한 웹사이트 사용을 지원하고, 맞춤형 서비스를 제공하기 위하여 ‘쿠키’와 ‘세션’을 운영합니다.
그 중 ‘쿠키’란 웹사이트를 운영하는데 이용되는 서버가 이용자의 브라우저에 보내는 작은 텍스트 파일로서 이용자의 컴퓨터에 저장되며, ‘세션’이란 웹사이트를 운영하는데 이용되는 서버가 이용자 로그인 시간 동안 이용자의 정보를 서버에 저장하는 것을 말합니다.
A402팀는 다음의 목적으로 ‘쿠키’와 ‘세션’을 운영하며, 사용자는 ‘쿠키’설치에 대한 선택권을 가지고 있습니다.
가. ‘쿠키’와 ‘세션’의 사용목적
‘쿠키’ 및 ‘세션’ 통해 이용자가 선호하는 설정 등을 저장하여 이용자에게 보다 빠른 웹 환경을 지원하며, 편리한
이용을 위해 서비스 개선에 활용합니다.
나. ‘쿠키’ 설정 거부방법
이용자는 웹 브라우저에서 옵션을 설정함으로써 모든 쿠키를 허용하거나, 쿠키가 저장될 때마다 확인을 거치거나, 모든 쿠키의 저장을 거부할 수도 있습니다.
다만 쿠키 설치를 거부할 경우 웹 사용이 불편해지며 로그인이 필요한 일부 서비스 이용에 어려움이 있을 수 있습니다.
- 설정방법
1) Internet Explorer의 경우: 웹 브라우저 상단의 도구 메뉴 > 인터넷 옵션 > 개인정보 > 설정
2) Chrome의 경우: 웹 브라우저 우측의 설정 메뉴 > 화면 하단의 고급 설정 표시 > 개인정보의 콘텐츠 설정 버튼 > 쿠키
다. ‘세션’의 설치/운영 및 거부
이용자는 세션 설치에 대한 선택권을 가지고 있지 않으며, 위탁업무를 포함하여 A402팀에서 제공하는 서비스 중 로그인이 필요한 경우 자동으로 A402팀운영 서버에서 세션을 생성하여 공통으로 사용됩니다.

10. 기타 개인정보 처리에 관한 방침
가. 이용자의 개인정보 관리 및 도용
이용자의 로그인 정보는 원칙적으로 이용자만이 사용하도록 되어 있습니다. 이용자 본인의 부주의로 ID, 비밀번호 등 개인정보의 유출, 타인의 사용으로 인하여 발생된 문제에 대해서 A402팀는 일체의 책임을 지지 않습니다. 또한 타인의 개인정보를 도용하여 회원 가입 또는 구매가 확인되었을 경우에는 이용계약이 일방적으로 해지될 수 있으며, 주민등록법에 의해 3년 이하의 징역 또는 1천만원 이하의 벌금이 부과될 수 있습니다.
나. 

11. 고지의무
본 개인정보 처리방침은 2020년 09월 24일에 제정되었습니다.
  </pre>
</template>

<script>
export default {
  name: "PrivacyPolicy",
};
</script>

<style lang="scss" scoped>
.content-text-include {
  text-align: left;
  white-space: pre-wrap;
  word-break: break-all;
}
</style>