<template>
  <div>
    <v-list class="custom-list">
      <v-list-item-group>
        <template v-for="(category, index) in Object.keys(marketCategories)">
          <v-hover v-slot:default="{ hover }" :key="index">
            <v-list-item
              :key="index"
              class="custom-list-item"
              :style="hover ? `background: ${listColor[index]}` : ''"
            >
              <v-list-item-content>
                <v-list-item-title>{{ category }}</v-list-item-title>
              </v-list-item-content>
            </v-list-item>
          </v-hover>
        </template>
      </v-list-item-group>
    </v-list>
  </div>
</template>

<script>
export default {
  name: "MarketCategory",
  data() {
    return {
      listColor: [
        "#cf6a87",
        "#f19066",
        "#fdcb6e",
        "#b8e994",
        "#82ccdd",
        "#60a3bc",
        "#786fa6",
        "#596275",
        "#63cdda",
        "#cf6a87",
        "#f19066",
        "#fdcb6e",
        "#b8e994",
        "#82ccdd",
        "#60a3bc",
        "#786fa6",
        "#596275",
      ],
      marketCategories: {
        뷰티: [
          "스킨케어",
          "메이크업",
          "팩/클렌징/필링",
          "헤어/바디",
          "향수",
          "네일케어",
          "남성 화장품",
          "가발/기타",
        ],
        "반려동물/취미": [
          "반려동물",
          "키덜트",
          "핸드메이드/DIY",
          "악기",
          "예술작품/골동품/수집",
          "미술재료/미술도구",
        ],
        패션잡화: [
          "운동화",
          "여성신발",
          "남성신발",
          "가방/핸드백",
          "지갑/벨트",
          "악세서리/귀금속",
          "시계",
          "선글라스/안경",
          "모자",
          "기타잡화/관련용품",
        ],
        "리빙/생활": [
          "주방용품",
          "차량용품",
          "가공식품",
          "욕실용품",
          "청소/세탁용품",
          "생활잡화",
          "기타 생활용품",
        ],
        "출산/유아동": [
          "출산/육아용품",
          "유아동안전/실내용품",
          "유아동의류",
          "유아동잡화",
          "유아동가구",
          "유아동교구/완구",
          "기타 유아동용품",
        ],
        "모바일/태블릿": [
          "스마트폰",
          "태블릿PC",
          "스마트워치/밴드",
          "일반/피쳐폰",
          "케이스/거치대/보호필름",
          "배터리/충전기/케이블",
          "메모리/젠더/리더기",
          "로밍/데이터/쿠폰",
        ],
        "레저/여행": [
          "등산의류/용품",
          "캠핑용품",
          "낚시용품",
          "기타 레저/여행용품",
        ],
        "공구/산업용품": [
          "드릴/전동공구",
          "에어/유압",
          "작업공구",
          "측정공구",
          "초경/절삭/접착윤활",
          "전기/전자",
          "배관설비/포장운송",
          "금형공작",
          "용접기자재",
          "산업/안전/공구함",
          "산업자재",
          "농기계/농업용공구",
        ],
        "카메라/캠코더": [
          "DSLR",
          "미러리스",
          "디지털카메라",
          "필름/즉석카메라",
          "캠코더/액션캠",
          "기타 카메라",
          "카메라렌즈",
          "삼각대/조명/플래시",
          "기타 악세서리",
        ],
        스포츠: [
          "골프",
          "자전거",
          "인라인/스케이트/전동",
          "축구",
          "야구",
          "농구",
          "라켓스포츠",
          "헬스/요가",
          "수상스포츠",
          "겨울스포츠",
          "검토/격투/권투",
          "기타 스포츠",
        ],
        "티켓/쿠폰": [
          "티켓",
          "상품권/쿠폰",
          "여행숙박/이용권",
          "기타 티켓/쿠폰/이용권",
        ],
        게임: [
          "PC게임",
          "플레이스테이션",
          "PSP",
          "닌텐도",
          "Wii",
          "XBOX",
          "게임타이틀",
          "기타 게임",
        ],
        "도서/음반/문구": [
          "유아동도서/음반",
          "학습/교육",
          "소설/만화책",
          "여행/취미/레저",
          "문학/과학/경영",
          "예술/디자인",
          "잡지",
          "기타 도서",
          "음반/DVD/굿즈",
          "문구/사무용품",
        ],
        가전제품: [
          "냉장고",
          "TV",
          "세탁기/건조기",
          "주방가전",
          "스마트홈",
          "영상가전",
          "음향가전",
          "계절가전",
          "생활가전",
          "미용가전",
          "기타 가전제품",
        ],
        "가구/인테리어": [
          "침실가구",
          "거실가구",
          "주방가구",
          "수납/선반/공간박스",
          "학생/서재/사무용가구",
          "기타가구",
          "침구",
          "커튼/카패트",
          "조명/무드등",
          "인테리어소품",
          "이벤트/파티용품",
          "디퓨저/캔들",
          "시계/액자/팝아트",
          "원예",
        ],
        패션의류: ["여성의류", "남성의류", "교복/체육복/단복"],
        "노트북/데스크탑": [
          "노트북/넷북",
          "데스크탑/본체",
          "모니터",
          "CPU/메인보드",
          "HDD/SSD/ODD",
          "RAM/VGA/SOUND",
          "USB/케이블",
          "케이스/파워/쿨러",
          "키보드/마우스/스피커",
          "프린터/복합기/잉크/토너",
          "공유기/랜카드",
          "소프트웨어",
          "기타 주변기기",
        ],
      },
    };
  },
};
</script>

<style scoped>
.custom-list {
  border: 2px solid black;
  border-radius: 10px;
  padding: 0 0;
}

.custom-list-item:not(:last-child) {
  border-bottom: 2px solid black;
}
</style>
